### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.function_apps.azurerm_key_vault_secret.func_user_uat_default_key will be created
  + resource "azurerm_key_vault_secret" "func_user_uat_default_key" {
      + content_type            = "token"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common"
      + name                    = "funciowalletuat-KEY-APPBACKEND"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.storage_accounts.azurerm_key_vault_secret.st_uat_connection_string will be created
  + resource "azurerm_key_vault_secret" "st_uat_connection_string" {
      + content_type            = "connection string"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01"
      + name                    = "StorageUatConnectionString"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          ~ "AllowedDeveloperUsers"                                     = "foo" -> "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=AllowedDeveloperUsers)"
          ~ "EntityConfigurationAuthorityHints"                         = "https://ta.wallet.ipzs.it" -> "https://pre.ta.wallet.ipzs.it"
          ~ "StorageConnectionString"                                   = "DefaultEndpointsProtocol=https;AccountName=iouitnwalletst01;AccountKey=NidZiilmTWb30GKTRgmIApngmacMJKtsOeAxMVfEEXTwrGrdWPHJvrEMRyYEAYD5CQ8TEwgMiDNK+ASt7x1JXQ==;EndpointSuffix=core.windows.net" -> "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=StorageUatConnectionString)"
            # (64 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-u-itn-wallet-user-func-01"
        name                                           = "io-u-itn-wallet-user-func-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_uat.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "AllowedDeveloperUsers"                                     = "foo" -> "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=AllowedDeveloperUsers)"
          ~ "EntityConfigurationAuthorityHints"                         = "https://ta.wallet.ipzs.it" -> "https://pre.ta.wallet.ipzs.it"
          ~ "StorageConnectionString"                                   = "foo" -> "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=StorageUatConnectionString)"
            # (65 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-u-itn-wallet-user-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "0.3.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>
